{"config": {"output_layers": [["dense_20", 0, 0]], "name": "model_5", "layers": [{"config": {"batch_input_shape": [null, 32, 32, 3], "sparse": false, "name": "input_5", "dtype": "float32"}, "name": "input_5", "inbound_nodes": [], "class_name": "InputLayer"}, {"config": {"name": "flatten_5", "trainable": true}, "name": "flatten_5", "inbound_nodes": [[["input_5", 0, 0, {}]]], "class_name": "Flatten"}, {"config": {"name": "dropout_13", "trainable": true, "rate": 0.3}, "name": "dropout_13", "inbound_nodes": [[["flatten_5", 0, 0, {}]]], "class_name": "Dropout"}, {"config": {"use_bias": true, "units": 1800, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "activation": "relu", "bias_regularizer": null, "name": "dense_17", "trainable": true, "kernel_regularizer": null, "activity_regularizer": null}, "name": "dense_17", "inbound_nodes": [[["dropout_13", 0, 0, {}]]], "class_name": "Dense"}, {"config": {"name": "dropout_14", "trainable": true, "rate": 0.3}, "name": "dropout_14", "inbound_nodes": [[["dense_17", 0, 0, {}]]], "class_name": "Dropout"}, {"config": {"use_bias": true, "units": 1000, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "activation": "relu", "bias_regularizer": null, "name": "dense_18", "trainable": true, "kernel_regularizer": null, "activity_regularizer": null}, "name": "dense_18", "inbound_nodes": [[["dropout_14", 0, 0, {}]]], "class_name": "Dense"}, {"config": {"name": "dropout_15", "trainable": true, "rate": 0.3}, "name": "dropout_15", "inbound_nodes": [[["dense_18", 0, 0, {}]]], "class_name": "Dropout"}, {"config": {"use_bias": true, "units": 90, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "activation": "relu", "bias_regularizer": null, "name": "dense_19", "trainable": true, "kernel_regularizer": null, "activity_regularizer": null}, "name": "dense_19", "inbound_nodes": [[["dropout_15", 0, 0, {}]]], "class_name": "Dense"}, {"config": {"use_bias": true, "units": 10, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "activation": "softmax", "bias_regularizer": null, "name": "dense_20", "trainable": true, "kernel_regularizer": null, "activity_regularizer": null}, "name": "dense_20", "inbound_nodes": [[["dense_19", 0, 0, {}]]], "class_name": "Dense"}], "input_layers": [["input_5", 0, 0]]}, "backend": "tensorflow", "keras_version": "2.0.8", "class_name": "Model"}