{"config": {"input_layers": [["input_14", 0, 0]], "name": "model_14", "layers": [{"config": {"sparse": false, "dtype": "float32", "name": "input_14", "batch_input_shape": [null, 32, 32, 3]}, "name": "input_14", "inbound_nodes": [], "class_name": "InputLayer"}, {"config": {"trainable": true, "name": "flatten_14"}, "name": "flatten_14", "inbound_nodes": [[["input_14", 0, 0, {}]]], "class_name": "Flatten"}, {"config": {"trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense_52", "kernel_regularizer": null, "use_bias": true, "units": 500, "bias_regularizer": null, "activation": "relu", "bias_constraint": null, "activity_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}}, "name": "dense_52", "inbound_nodes": [[["flatten_14", 0, 0, {}]]], "class_name": "Dense"}, {"config": {"trainable": true, "name": "dropout_25", "rate": 0.2}, "name": "dropout_25", "inbound_nodes": [[["dense_52", 0, 0, {}]]], "class_name": "Dropout"}, {"config": {"trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense_53", "kernel_regularizer": null, "use_bias": true, "units": 500, "bias_regularizer": null, "activation": "relu", "bias_constraint": null, "activity_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}}, "name": "dense_53", "inbound_nodes": [[["dropout_25", 0, 0, {}]]], "class_name": "Dense"}, {"config": {"trainable": true, "name": "dropout_26", "rate": 0.2}, "name": "dropout_26", "inbound_nodes": [[["dense_53", 0, 0, {}]]], "class_name": "Dropout"}, {"config": {"trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense_54", "kernel_regularizer": null, "use_bias": true, "units": 500, "bias_regularizer": null, "activation": "relu", "bias_constraint": null, "activity_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}}, "name": "dense_54", "inbound_nodes": [[["dropout_26", 0, 0, {}]]], "class_name": "Dense"}, {"config": {"trainable": true, "name": "dropout_27", "rate": 0.2}, "name": "dropout_27", "inbound_nodes": [[["dense_54", 0, 0, {}]]], "class_name": "Dropout"}, {"config": {"trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense_55", "kernel_regularizer": null, "use_bias": true, "units": 10, "bias_regularizer": null, "activation": "softmax", "bias_constraint": null, "activity_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}}, "name": "dense_55", "inbound_nodes": [[["dropout_27", 0, 0, {}]]], "class_name": "Dense"}], "output_layers": [["dense_55", 0, 0]]}, "keras_version": "2.0.8", "class_name": "Model", "backend": "tensorflow"}