{"keras_version": "2.0.8", "config": {"output_layers": [["dense_2", 0, 0]], "name": "model_2", "input_layers": [["input_2", 0, 0]], "layers": [{"name": "input_2", "inbound_nodes": [], "config": {"dtype": "float32", "sparse": false, "name": "input_2", "batch_input_shape": [null, 32, 32, 3]}, "class_name": "InputLayer"}, {"name": "block1_conv1", "inbound_nodes": [[["input_2", 0, 0, {}]]], "config": {"data_format": "channels_last", "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "name": "block1_conv1", "kernel_constraint": null, "filters": 32, "padding": "same", "use_bias": true, "strides": [1, 1], "dilation_rate": [1, 1], "trainable": true, "kernel_regularizer": null, "activity_regularizer": null, "activation": "relu", "kernel_size": [3, 3], "bias_constraint": null}, "class_name": "Conv2D"}, {"name": "dropout_7", "inbound_nodes": [[["block1_conv1", 0, 0, {}]]], "config": {"name": "dropout_7", "trainable": true, "rate": 0.35}, "class_name": "Dropout"}, {"name": "block1_conv2", "inbound_nodes": [[["dropout_7", 0, 0, {}]]], "config": {"data_format": "channels_last", "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "name": "block1_conv2", "kernel_constraint": null, "filters": 32, "padding": "same", "use_bias": true, "strides": [1, 1], "dilation_rate": [1, 1], "trainable": true, "kernel_regularizer": null, "activity_regularizer": null, "activation": "relu", "kernel_size": [3, 3], "bias_constraint": null}, "class_name": "Conv2D"}, {"name": "block1_pool", "inbound_nodes": [[["block1_conv2", 0, 0, {}]]], "config": {"data_format": "channels_last", "strides": [2, 2], "name": "block1_pool", "trainable": true, "pool_size": [2, 2], "padding": "valid"}, "class_name": "MaxPooling2D"}, {"name": "block2_conv1", "inbound_nodes": [[["block1_pool", 0, 0, {}]]], "config": {"data_format": "channels_last", "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "name": "block2_conv1", "kernel_constraint": null, "filters": 64, "padding": "same", "use_bias": true, "strides": [1, 1], "dilation_rate": [1, 1], "trainable": true, "kernel_regularizer": null, "activity_regularizer": null, "activation": "relu", "kernel_size": [3, 3], "bias_constraint": null}, "class_name": "Conv2D"}, {"name": "dropout_8", "inbound_nodes": [[["block2_conv1", 0, 0, {}]]], "config": {"name": "dropout_8", "trainable": true, "rate": 0.35}, "class_name": "Dropout"}, {"name": "block2_conv2", "inbound_nodes": [[["dropout_8", 0, 0, {}]]], "config": {"data_format": "channels_last", "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "name": "block2_conv2", "kernel_constraint": null, "filters": 64, "padding": "same", "use_bias": true, "strides": [1, 1], "dilation_rate": [1, 1], "trainable": true, "kernel_regularizer": null, "activity_regularizer": null, "activation": "relu", "kernel_size": [3, 3], "bias_constraint": null}, "class_name": "Conv2D"}, {"name": "block2_pool", "inbound_nodes": [[["block2_conv2", 0, 0, {}]]], "config": {"data_format": "channels_last", "strides": [2, 2], "name": "block2_pool", "trainable": true, "pool_size": [2, 2], "padding": "valid"}, "class_name": "MaxPooling2D"}, {"name": "block3_conv1", "inbound_nodes": [[["block2_pool", 0, 0, {}]]], "config": {"data_format": "channels_last", "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "name": "block3_conv1", "kernel_constraint": null, "filters": 128, "padding": "same", "use_bias": true, "strides": [1, 1], "dilation_rate": [1, 1], "trainable": true, "kernel_regularizer": null, "activity_regularizer": null, "activation": "relu", "kernel_size": [3, 3], "bias_constraint": null}, "class_name": "Conv2D"}, {"name": "dropout_9", "inbound_nodes": [[["block3_conv1", 0, 0, {}]]], "config": {"name": "dropout_9", "trainable": true, "rate": 0.35}, "class_name": "Dropout"}, {"name": "block3_conv2", "inbound_nodes": [[["dropout_9", 0, 0, {}]]], "config": {"data_format": "channels_last", "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "name": "block3_conv2", "kernel_constraint": null, "filters": 128, "padding": "same", "use_bias": true, "strides": [1, 1], "dilation_rate": [1, 1], "trainable": true, "kernel_regularizer": null, "activity_regularizer": null, "activation": "relu", "kernel_size": [3, 3], "bias_constraint": null}, "class_name": "Conv2D"}, {"name": "block3_pool", "inbound_nodes": [[["block3_conv2", 0, 0, {}]]], "config": {"data_format": "channels_last", "strides": [2, 2], "name": "block3_pool", "trainable": true, "pool_size": [2, 2], "padding": "valid"}, "class_name": "MaxPooling2D"}, {"name": "flatten", "inbound_nodes": [[["block3_pool", 0, 0, {}]]], "config": {"name": "flatten", "trainable": true}, "class_name": "Flatten"}, {"name": "dropout_10", "inbound_nodes": [[["flatten", 0, 0, {}]]], "config": {"name": "dropout_10", "trainable": true, "rate": 0.35}, "class_name": "Dropout"}, {"name": "fc1", "inbound_nodes": [[["dropout_10", 0, 0, {}]]], "config": {"kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "name": "fc1", "kernel_constraint": {"config": {"max_value": 3, "axis": 0}, "class_name": "MaxNorm"}, "activity_regularizer": null, "activation": "relu", "trainable": true, "kernel_regularizer": null, "units": 1024, "use_bias": true, "bias_constraint": null}, "class_name": "Dense"}, {"name": "dropout_11", "inbound_nodes": [[["fc1", 0, 0, {}]]], "config": {"name": "dropout_11", "trainable": true, "rate": 0.35}, "class_name": "Dropout"}, {"name": "fc2", "inbound_nodes": [[["dropout_11", 0, 0, {}]]], "config": {"kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "name": "fc2", "kernel_constraint": {"config": {"max_value": 3, "axis": 0}, "class_name": "MaxNorm"}, "activity_regularizer": null, "activation": "relu", "trainable": true, "kernel_regularizer": null, "units": 512, "use_bias": true, "bias_constraint": null}, "class_name": "Dense"}, {"name": "dropout_12", "inbound_nodes": [[["fc2", 0, 0, {}]]], "config": {"name": "dropout_12", "trainable": true, "rate": 0.35}, "class_name": "Dropout"}, {"name": "dense_2", "inbound_nodes": [[["dropout_12", 0, 0, {}]]], "config": {"kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "name": "dense_2", "kernel_constraint": null, "activity_regularizer": null, "activation": "softmax", "trainable": true, "kernel_regularizer": null, "units": 10, "use_bias": true, "bias_constraint": null}, "class_name": "Dense"}]}, "backend": "tensorflow", "class_name": "Model"}