{"config": {"output_layers": [["dense_4", 0, 0]], "input_layers": [["input_9", 0, 0]], "name": "model_4", "layers": [{"inbound_nodes": [], "config": {"batch_input_shape": [null, 32, 32, 3], "dtype": "float32", "name": "input_9", "sparse": false}, "class_name": "InputLayer", "name": "input_9"}, {"inbound_nodes": [[["input_9", 0, 0, {}]]], "config": {"kernel_size": [3, 3], "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "trainable": true, "dilation_rate": [1, 1], "activation": "relu", "padding": "same", "kernel_constraint": null, "strides": [1, 1], "data_format": "channels_last", "activity_regularizer": null, "filters": 32, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "bias_constraint": null, "bias_regularizer": null, "name": "block1_conv1"}, "class_name": "Conv2D", "name": "block1_conv1"}, {"inbound_nodes": [[["block1_conv1", 0, 0, {}]]], "config": {"trainable": true, "name": "dropout_36", "rate": 0.2}, "class_name": "Dropout", "name": "dropout_36"}, {"inbound_nodes": [[["dropout_36", 0, 0, {}]]], "config": {"kernel_size": [3, 3], "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "trainable": true, "dilation_rate": [1, 1], "activation": "relu", "padding": "same", "kernel_constraint": null, "strides": [1, 1], "data_format": "channels_last", "activity_regularizer": null, "filters": 32, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "bias_constraint": null, "bias_regularizer": null, "name": "block1_conv2"}, "class_name": "Conv2D", "name": "block1_conv2"}, {"inbound_nodes": [[["block1_conv2", 0, 0, {}]]], "config": {"strides": [2, 2], "pool_size": [2, 2], "data_format": "channels_last", "trainable": true, "padding": "valid", "name": "block1_pool"}, "class_name": "MaxPooling2D", "name": "block1_pool"}, {"inbound_nodes": [[["block1_pool", 0, 0, {}]]], "config": {"kernel_size": [3, 3], "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "trainable": true, "dilation_rate": [1, 1], "activation": "relu", "padding": "same", "kernel_constraint": null, "strides": [1, 1], "data_format": "channels_last", "activity_regularizer": null, "filters": 64, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "bias_constraint": null, "bias_regularizer": null, "name": "block2_conv1"}, "class_name": "Conv2D", "name": "block2_conv1"}, {"inbound_nodes": [[["block2_conv1", 0, 0, {}]]], "config": {"trainable": true, "name": "dropout_37", "rate": 0.2}, "class_name": "Dropout", "name": "dropout_37"}, {"inbound_nodes": [[["dropout_37", 0, 0, {}]]], "config": {"kernel_size": [3, 3], "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "trainable": true, "dilation_rate": [1, 1], "activation": "relu", "padding": "same", "kernel_constraint": null, "strides": [1, 1], "data_format": "channels_last", "activity_regularizer": null, "filters": 164, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "bias_constraint": null, "bias_regularizer": null, "name": "block2_conv2"}, "class_name": "Conv2D", "name": "block2_conv2"}, {"inbound_nodes": [[["block2_conv2", 0, 0, {}]]], "config": {"strides": [2, 2], "pool_size": [2, 2], "data_format": "channels_last", "trainable": true, "padding": "valid", "name": "block2_pool"}, "class_name": "MaxPooling2D", "name": "block2_pool"}, {"inbound_nodes": [[["block2_pool", 0, 0, {}]]], "config": {"kernel_size": [3, 3], "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "trainable": true, "dilation_rate": [1, 1], "activation": "relu", "padding": "same", "kernel_constraint": null, "strides": [1, 1], "data_format": "channels_last", "activity_regularizer": null, "filters": 128, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "bias_constraint": null, "bias_regularizer": null, "name": "block3_conv1"}, "class_name": "Conv2D", "name": "block3_conv1"}, {"inbound_nodes": [[["block3_conv1", 0, 0, {}]]], "config": {"trainable": true, "name": "dropout_38", "rate": 0.2}, "class_name": "Dropout", "name": "dropout_38"}, {"inbound_nodes": [[["dropout_38", 0, 0, {}]]], "config": {"kernel_size": [3, 3], "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "trainable": true, "dilation_rate": [1, 1], "activation": "relu", "padding": "same", "kernel_constraint": null, "strides": [1, 1], "data_format": "channels_last", "activity_regularizer": null, "filters": 128, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "bias_constraint": null, "bias_regularizer": null, "name": "block3_conv2"}, "class_name": "Conv2D", "name": "block3_conv2"}, {"inbound_nodes": [[["block3_conv2", 0, 0, {}]]], "config": {"strides": [2, 2], "pool_size": [2, 2], "data_format": "channels_last", "trainable": true, "padding": "valid", "name": "block3_pool"}, "class_name": "MaxPooling2D", "name": "block3_pool"}, {"inbound_nodes": [[["block3_pool", 0, 0, {}]]], "config": {"kernel_size": [3, 3], "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "trainable": true, "dilation_rate": [1, 1], "activation": "relu", "padding": "same", "kernel_constraint": null, "strides": [1, 1], "data_format": "channels_last", "activity_regularizer": null, "filters": 256, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "bias_constraint": null, "bias_regularizer": null, "name": "block4_conv1"}, "class_name": "Conv2D", "name": "block4_conv1"}, {"inbound_nodes": [[["block4_conv1", 0, 0, {}]]], "config": {"trainable": true, "name": "dropout_39", "rate": 0.2}, "class_name": "Dropout", "name": "dropout_39"}, {"inbound_nodes": [[["dropout_39", 0, 0, {}]]], "config": {"kernel_size": [3, 3], "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "trainable": true, "dilation_rate": [1, 1], "activation": "relu", "padding": "same", "kernel_constraint": null, "strides": [1, 1], "data_format": "channels_last", "activity_regularizer": null, "filters": 256, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "bias_constraint": null, "bias_regularizer": null, "name": "block4_conv2"}, "class_name": "Conv2D", "name": "block4_conv2"}, {"inbound_nodes": [[["block4_conv2", 0, 0, {}]]], "config": {"strides": [2, 2], "pool_size": [2, 2], "data_format": "channels_last", "trainable": true, "padding": "valid", "name": "block4_pool"}, "class_name": "MaxPooling2D", "name": "block4_pool"}, {"inbound_nodes": [[["block4_pool", 0, 0, {}]]], "config": {"trainable": true, "name": "flatten"}, "class_name": "Flatten", "name": "flatten"}, {"inbound_nodes": [[["flatten", 0, 0, {}]]], "config": {"trainable": true, "name": "dropout_40", "rate": 0.2}, "class_name": "Dropout", "name": "dropout_40"}, {"inbound_nodes": [[["dropout_40", 0, 0, {}]]], "config": {"use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "trainable": true, "units": 1024, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "kernel_constraint": {"config": {"axis": 0, "max_value": 3}, "class_name": "MaxNorm"}, "bias_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "activation": "relu", "name": "fc1"}, "class_name": "Dense", "name": "fc1"}, {"inbound_nodes": [[["fc1", 0, 0, {}]]], "config": {"trainable": true, "name": "dropout_41", "rate": 0.2}, "class_name": "Dropout", "name": "dropout_41"}, {"inbound_nodes": [[["dropout_41", 0, 0, {}]]], "config": {"use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "trainable": true, "units": 512, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "kernel_constraint": {"config": {"axis": 0, "max_value": 3}, "class_name": "MaxNorm"}, "bias_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "activation": "relu", "name": "fc2"}, "class_name": "Dense", "name": "fc2"}, {"inbound_nodes": [[["fc2", 0, 0, {}]]], "config": {"trainable": true, "name": "dropout_42", "rate": 0.2}, "class_name": "Dropout", "name": "dropout_42"}, {"inbound_nodes": [[["dropout_42", 0, 0, {}]]], "config": {"use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "trainable": true, "units": 10, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "bias_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "activation": "softmax", "name": "dense_4"}, "class_name": "Dense", "name": "dense_4"}]}, "class_name": "Model", "backend": "tensorflow", "keras_version": "2.0.8"}